In [1]:
# You need to mount your drive and upload files to drive.
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
# Import these libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# We will use the property data.csv file, make sure once GDrive is mounted, you link the data path by right clicking on the left pane.
data = pd.read_csv("propertyData.csv")
data

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [4]:
#Viewing the first 5 rows
data.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [5]:
#viewing the last 5 rows
data.tail()

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [6]:
#Dataset shape
data.shape

(9, 7)

In [7]:
#Dataset basic analysis
data.describe()

                PID      ST_NUM
count  8.000000e+00    7.000000
mean   1.000050e+08  191.428571
std    2.927700e+03   39.080503
min    1.000010e+08  104.000000
25%    1.000028e+08  199.000000
50%    1.000050e+08  203.000000
75%    1.000072e+08  210.000000
max    1.000090e+08  215.000000

In [ ]:
# to see data types
data.dtypes

* Note that Pandas library only recognizes NaN as the missing value. It skips other missing values, e.g. na, NULL and N/A. See the following solution to address this issue.

In [ ]:
# You can define a list to represent all missing values
missing_values = ["n/a", "na", "--"]
df = pd.read_csv("/content/drive/MyDrive/Colab-Notebooks/propertyData.csv", na_values = missing_values)

In [ ]:
# check data and df differences to see how na and -- became NaN
df

In [ ]:
print(df['NUM_BEDROOMS'])

In [ ]:
print(df['NUM_BEDROOMS'].isnull())

In [ ]:
print(df['OWN_OCCUPIED'])

In [ ]:
# Looking at the OWN_OCCUPIED column
print(df['OWN_OCCUPIED'].isnull())

In [ ]:
#Showing total number of NaN values
df.isnull().sum()

In [ ]:
#Return true if any NaN values
df.isnull().any()

In [ ]:
#Total number of missing values - all table
df.isnull().sum().sum()

In [ ]:
# Replace missing values with any number
df['ST_NUM'].fillna(111, inplace=True)

In [ ]:
print(df)

In [ ]:
# Location based replacement - 4th row in ST_NUM column
df.loc[4,'ST_NUM'] = 125

In [ ]:
print(df)

In [ ]:
# Replace using median value
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [ ]:
df

In [ ]:
# If you want to drop "any" rows that contain NaN
# If you set "how" to "all", then the row is dropped only when all values are NaN
# Axis=0 is for dropping rows, Axis=1 is for dropping columns that contain NaN
df=df.dropna(axis=0, how='any')
print(df)

In [ ]:
#Replace all Nan values with 1212, by default returns a copy of the dataFrame as inplace is set to False.
df.fillna(1212)
#Replace all NaN values with forward fill, with the values above it.
df.ffill()
#Replace all Nan values with backward fill, with the values below it.
df.bfill()
#Replace all values with interpolation, average below and above values only if they are additive.
# You can check datatypes with "df.dtypes" and see why NaN values were not interpolated.
df.interpolate()
df.dtypes

In [ ]:
# lets observe the datatypes for categorical features using df.dtypes
df.dtypes
# We know that there is a NaN value in OWN_OCCUPIED column
from sklearn.impute import SimpleImputer
import pandas as pdx
imputer = SimpleImputer(strategy='most_frequent')
dataarray=imputer.fit_transform(df['OWN_OCCUPIED'].to_numpy().reshape(-1, 1))
print(dataarray)
#dfconvert=pdx.DataFrame(dataarray,columns=['PID',	'ST_NUM',	'ST_NAME',	'OWN_OCCUPIED',	'NUM_BEDROOMS',	'NUM_BATH',	'SQ_FT'])
dfconvert=pdx.DataFrame(dataarray,columns=['OWN_OCCUPIED'])
print(dfconvert)
print(df)
# Missing value is imputed with 'Y'

In [ ]:
#Imputing missing values using Sci-kit library
#SimpleImputer is used for Univariate approach considering a single feature.
#There are other methods, such as KNNImputer/IterativeImputer, which can be used for Multivariate and Nearest Neighbours Imputations.
from sklearn.impute import SimpleImputer
import pandas as pdy
imp = SimpleImputer(missing_values=np.nan, strategy='mean')
idf=pdy.DataFrame(imp.fit_transform(df['SQ_FT'].to_numpy().reshape(-1,1)))
print(idf)
print(df)

In [ ]:
# Can you now integrate the idf data int df by replacing the SQ_FT column?
df['SQ_FT']=idf[0]
print(df)

In [ ]:
df3 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df4 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

result = pd.concat([df3,df4], axis=0, join="outer") # axis 1 refers to column, 0 refers to row # join=outer (union) by default and inner (intersection)
result

In [ ]:
d2 = {'Name': ['Lily', 'Meghna', 'Lisa'], 'Country': ['UK', 'India', 'USA'], 'Role': ['CEO', 'CTO', 'CTO']}
df6 = pd.DataFrame(d2)
#display(df6)
#print('DataFrame 1:\n', df6)
df7 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Lily', 'Eric', 'Johanna']})
#display(df7)
#print('DataFrame 2:\n', df7)

df_merged = df6.merge(df7) #default merging - inner join
#print('Result:\n', df_merged)
df_merged

In [ ]:
print('Result Left Join:\n', df6.merge(df7, how='left'))

In [ ]:
print('Result Right Join:\n', df6.merge(df7, how='right'))

In [ ]:
#print('Result Outer Join:\n', df6.merge(df7, how='outer'))
df_merged=df6.merge(df7, how='outer')
df_merged